src/InformationRegisters/Спец_ПараметрыОбменовСДругимиБазами/Спец_ПараметрыОбменовСДругимиБазами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Спец_ПараметрыОбменовСДругимиБазами</name>
  <comment>Регистр для хранения параметров обмена с другими базами</comment>
  <resources>
    <name>ОбменВключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПолноеИмяОбъектаМетаданныхПриемник</name>
    <type>
      <types>DefinedType.Спец_ИмяОбъектаБазы</types>
    </type>
  </resources>
  <resources>
    <name>ВызыватьЗаписьПринудительно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИмяРеквизитаДляПроверкиВКлючевыхОбъектах</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИскатьОбъектыБезУчетаПустогоГУИДа</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИсправлятьГУИДыОбъектов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПериодОбменаДляПолногоОбновления</name>
    <type>
      <types>EnumRef.Спец_ПериодыОбменаДляОбъектов</types>
    </type>
  </resources>
  <resources>
    <name>ПисатьНапрямуюВБД</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПропуститьРегистрациюУдаленныхОбъектов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РегистрироватьСОбменомДанными</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТипОбмена</name>
    <type>
      <types>EnumRef.Спец_ТипыОбменовСДругимиБазами</types>
    </type>
  </resources>
  <resources>
    <name>ТипПередачи</name>
    <type>
      <types>EnumRef.Спец_ТипыПередачиОбъектовДляОбмена</types>
    </type>
  </resources>
  <resources>
    <name>ТолькоПолучатьГУИД</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТолькоСоздаватьВБазе</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоБольшаяТаблица</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаПоследнегоПолногоОбновления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейПроверкиГУИДов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапросаДляПолученияОбъектов_Отправитель</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапросаДляПолученияОбъектов_Получатель</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапросаИсключения_Отправитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапросаИсключения_Получатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстыЗапросовДляЗаписиНапрямую</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстыЗапросовДляПолногоОбновленияНапрямую</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПолногоСравнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>21</precision>
        <scale>9</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>База</name>
    <type>
      <types>CatalogRef.Спец_Базы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПолноеИмяОбъектаМетаданныхИсточник</name>
    <type>
      <types>DefinedType.Спец_ИмяОбъектаБазы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Спец_ПараметрыОбменовСДругимиБазами/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьКрасивуюПанельОтборов();
	Спец_РаботаСФормами.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Спец_РаботаСФормамиКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Подключаемый_ОбработкаСобытияОтбора(Элемент, СтандартнаяОбработка = Истина)
	
	Спец_РаботаСФормамиКлиент.ОбработатьСобытиеОтбора(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СоздатьКрасивуюПанельОтборов()
	
	СтруктураПараметровПанели = Спец_РаботаСФормами.НоваяСтруктураПараметровВыводаПанелиКрасивыхОтборов(Элементы.Список,
			Элементы.НастройкаСписка,
			Элементы.СписокКомпоновщикНастроекПользовательскиеНастройки);
	
	Спец_РаботаСФормами.ДобавитьНовыйОтборНаПанель(СтруктураПараметровПанели,
			"База",
			ВидСравненияКомпоновкиДанных.Равно,
			"База");
	
	Спец_РаботаСФормами.ДобавитьНовыйОтборНаПанель(СтруктураПараметровПанели,
			"ПолноеИмяОбъектаМетаданныхИсточник",
			ВидСравненияКомпоновкиДанных.Содержит,
			"Полное имя объекта метаданных (источник)");
	
	Спец_РаботаСФормами.ДобавитьНовыйОтборНаПанель(СтруктураПараметровПанели,
			"ПолноеИмяОбъектаМетаданныхПриемник",
			ВидСравненияКомпоновкиДанных.Содержит,
			"Полное имя объекта метаданных (приёмник)");
	
	Спец_РаботаСФормами.ДобавитьНовыйОтборНаПанель(СтруктураПараметровПанели,
			"ОбменВключен",
			ВидСравненияКомпоновкиДанных.Равно,
			"Только с включённым обменом");
	
	Спец_РаботаСФормами.ДобавитьНовыйОтборНаПанель(СтруктураПараметровПанели,
			"ПисатьНапрямуюВБД",
			ВидСравненияКомпоновкиДанных.Равно,
			"Только с записью напрямую в БД");
	
	Спец_РаботаСФормами.ВывестиПанельОтборовНаФорму(ЭтотОбъект, СтруктураПараметровПанели);
	
КонецПроцедуры

#КонецОбласти
